Revit 2024 API
MassDisplayTemporaryOverrideType Enumeration
 This enum identifies the mass display overrides.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2012
Since: 2012
Syntax
C#
public enum MassDisplayTemporaryOverrideType
Visual Basic
Public Enumeration MassDisplayTemporaryOverrideType
Visual C++
public enum class MassDisplayTemporaryOverrideType
Members
Member name | Description
ShowMassByViewSettings |  Mass will be displayed in each view based on the visibility settings of that view.
ShowMassFormAndFloors |  Mass form and mass floor subcategories will be displayed in all views.
ShowMassSurfaceTypes |  Mass energy analysis surface subcategories (and Mass Floors) will be displayed.
ShowMassZonesAndShades |  Mass zone and mass shade subcategories will be displayed.
See Also
Autodesk.Revit.DB Namespace